# Retrive rows by index position

In [4]:
import pandas as pd

In [5]:
bond =pd.read_csv("jamesbond.csv",index_col=["Film"])

In [6]:
bond.loc["Casino Royale"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3

In [7]:
bond.iloc[15]

Year                        1985
Actor                Roger Moore
Director               John Glen
Box Office                 275.2
Budget                      54.5
Bond Actor Salary            9.1
Name: A View to a Kill, dtype: object

In [8]:
bond.iloc[6:9]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN

In [9]:
bond.count()

Year                 26
Actor                26
Director             26
Box Office           26
Budget               26
Bond Actor Salary    18
dtype: int64

In [10]:
bond.iloc[[5,10,15,20]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5

# catch all.ix() method

In [11]:
bond.ix[["You Only Live Twice","Casino Royale","A View to a Kill"]]

/home/hadoop/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [12]:
bond.loc["Spectre"]

Year                         2015
Actor                Daniel Craig
Director               Sam Mendes
Box Office                  726.7
Budget                      206.3
Bond Actor Salary             NaN
Name: Spectre, dtype: object

In [13]:
bond.index

Index(['Dr. No', 'From Russia with Love', 'Goldfinger', 'Thunderball',
       'Casino Royale', 'You Only Live Twice',
       'On Her Majesty's Secret Service', 'Diamonds Are Forever',
       'Live and Let Die', 'The Man with the Golden Gun',
       'The Spy Who Loved Me', 'Moonraker', 'For Your Eyes Only',
       'Never Say Never Again', 'Octopussy', 'A View to a Kill',
       'The Living Daylights', 'Licence to Kill', 'GoldenEye',
       'Tomorrow Never Dies', 'The World Is Not Enough', 'Die Another Day',
       'Casino Royale', 'Quantum of Solace', 'Skyfall', 'Spectre'],
      dtype='object', name='Film')

# second argument to.loc[],iloc and ix[] method

In [2]:
pd.read_csv("jamesbond.csv",index_col=["Film"])
bond.sort_index(inplace=True)

NameError: name 'pd' is not defined

In [3]:
bond.head()

NameError: name 'bond' is not defined

In [14]:
bond.loc["Diamonds Are Forever"]

Year                         1971
Actor                Sean Connery
Director             Guy Hamilton
Box Office                  442.5
Budget                       34.7
Bond Actor Salary             5.8
Name: Diamonds Are Forever, dtype: object

In [19]:
bond.loc[["Diamonds Are Forever","Director"]]

/home/hadoop/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Diamonds Are Forever,1971.0,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Director,NaN,NaN,NaN,NaN,NaN,NaN

In [1]:
bond.iloc[["Casino Royal","Director","Budget"]]

NameError: name 'bond' is not defined

In [25]:
bond.reset_index(inplace=True)

In [26]:
bond.iloc[["Spectre"],["Budget","Year"]]

TypeError: cannot perform reduce with flexible type

# Dataframe 3

In [27]:
import pandas as pd

In [28]:
df=pd.read_csv("employees.csv")

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [31]:
df["Start Date"]=pd.to_datetime(df["Last Login Time"])

In [34]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,2019-02-24 12:42:00,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,2019-02-24 06:53:00,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,2019-02-24 11:17:00,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2019-02-24 13:00:00,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,2019-02-24 16:47:00,4:47 PM,101004,1.389,True,Client Services

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [37]:
df["Senior Management"]=df["Senior Management"].astype(bool)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 55.7+ KB

In [42]:
df['Gender']=df["Gender"].astype("category")

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 49.0+ KB

In [44]:
df["Team"]=df["Team"].astype("category")

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null category
dtypes: bool(1), category(2), datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 42.6+ KB

In [53]:
df.head()

,Start Date_Last Login Time,First Name,Gender,Salary,Bonus %,Senior Management,Team
0,1993-08-06 12:42:00,Douglas,Male,97308,6.945,True,Marketing
1,1996-03-31 06:53:00,Thomas,Male,61933,4.170,True,NaN
2,1993-04-23 11:17:00,Maria,Female,130590,11.858,False,Finance
3,2005-03-04 13:00:00,Jerry,Male,138705,9.340,True,Finance
4,1998-01-24 16:47:00,Larry,Male,101004,1.389,True,Client Services

In [48]:
df=pd.read_csv("employees.csv",parse_dates=[["Start Date","Last Login Time"]])

In [52]:
df.head()

,Start Date_Last Login Time,First Name,Gender,Salary,Bonus %,Senior Management,Team
0,1993-08-06 12:42:00,Douglas,Male,97308,6.945,True,Marketing
1,1996-03-31 06:53:00,Thomas,Male,61933,4.170,True,NaN
2,1993-04-23 11:17:00,Maria,Female,130590,11.858,False,Finance
3,2005-03-04 13:00:00,Jerry,Male,138705,9.340,True,Finance
4,1998-01-24 16:47:00,Larry,Male,101004,1.389,True,Client Services

In [51]:
df[df["Gender"]=="Male"].head()

,Start Date_Last Login Time,First Name,Gender,Salary,Bonus %,Senior Management,Team
0,1993-08-06 12:42:00,Douglas,Male,97308,6.945,True,Marketing
1,1996-03-31 06:53:00,Thomas,Male,61933,4.170,True,NaN
3,2005-03-04 13:00:00,Jerry,Male,138705,9.340,True,Finance
4,1998-01-24 16:47:00,Larry,Male,101004,1.389,True,Client Services
5,1987-04-18 01:35:00,Dennis,Male,115163,10.125,False,Legal

In [56]:
df[df["Team"]=="Finance"].head()

,Start Date_Last Login Time,First Name,Gender,Salary,Bonus %,Senior Management,Team
2,1993-04-23 11:17:00,Maria,Female,130590,11.858,False,Finance
3,2005-03-04 13:00:00,Jerry,Male,138705,9.340,True,Finance
7,2015-07-20 10:43:00,NaN,Female,45906,11.598,NaN,Finance
14,1999-01-14 07:13:00,Kimberly,Female,41426,14.543,True,Finance
46,2009-11-28 22:47:00,Bruce,Male,114796,6.796,False,Finance